#include <iostream>
#include <cmath>
using namespace std;

int v1()
{
	setlocale(LC_ALL, "Russian");
	cout << "Задание 1. Дано вещественное число - цена 1 кг конфет. Вывести стоимость 0.1, 0.2, ... , 1 кг конфет.\n";
	double a;
	cout << "Введите цену за 1 кг конфет\n";
	cin >> a;
	for (double i = 0.1; i <= 1.0; i = i + 0.1)
	{
		cout << "Цена за " << i << " кг конфет = " << a * i << " руб\n";
	}
	cout << "\n";
	return 0;
}

int v2()
{
	setlocale(LC_ALL, "Russian");
	cout << "Задание 2. Дано целое число N (> 0). Найти произведение 1.1 * 1.2 * 1.3 * ... (N сомножителей).\n\n";
	double i = 1.1, p = 1;
	int n;
	cout << "Введите целое число N\n";
	cin >> n;
	for (int k = 1; k <= n; k++)
	{
		p = p * i;
		i = i + 0.1;
	}
	cout << "Произведение N сомножителей = " << p << "\n\n";
	return 0;
}

int v3()
{
	setlocale(LC_ALL, "Russian");
	cout << "Задание 3. Дано целое число N (> 0). Найти квадрат данного числа, используя для его вычисления следующую формулу: N^2 = 1 + 3 + 5 + ... + (2·N - 1). После добавления к сумме каждого слагаемого выводить текущее значение суммы\n\n";
	int n, a, i;
	cout << "Введите целое число N\n";
	cin >> n;
	a = 0;
	cout << "Квадрат данного числа вычисляется ...\n";
	for (i = 1; i <= (2 * n - 1); i = i + 2)
	{
		a = a + i;
		cout << a << "\n";
	}
	cout << "\n";
	return 0;
}

int v4()
{
	setlocale(LC_ALL, "Russian");
	cout << "Задание 4. Дано вещественное число A и целое число N (> 0). Используя один цикл, найти сумму 1 + A + A^2 + A^3 + ... + A^N\n\n";
	double a, s = 1, a2 = 1;
	int n, i;
	cout << "Введите вещественное число A\n";
	cin >> a;
	cout << "Введите целое число N\n";
	cin >> n;
	for (i = 1; i <= n; i++)
	{
		a2 = a2 * a;
		s = s + a2;
	}
	cout << "Сумма 1 + А + А^2 + A^3 + ... + A^N = " << s << "\n\n";
	return 0;
}

int v5()
{
	setlocale(LC_ALL, "Russian");
	cout << "Задание 5. Дано вещественное число A и целое число N (> 0). Используя один цикл, найти значение выражения 1 - A + A^2 - A^3 + ... +(-) A^N.\n\n";
	int n, i;
	double a, a2 = 1, s = 1;
	cout << "Введите вещественное число A" << endl;
	cin >> a;
	cout << "Введите целое число N (N>0)" << endl;
	cin >> n;
	for (i = 1; i <= n; i++)
	{
		a2 = a2 * a * (-1);
		s = s + a2;
	}
	cout << "Сумма 1 - А + А^2 - A^3 + ... +(-) A^N = " << s << "\n\n";
	return 0;
}

int main()
{
	v1();
	v2();
	v3();
	v4();
	v5();
	return 0;
}